"""
简易购物车
"""
shopping_cart = {
    "iPhone 15": {"商品价格": 6999, "商品数量": 2},
    "华为Mate 60": {"商品价格": 6499, "商品数量": 3},
    "小米14": {"商品价格": 3999, "商品数量": 8},
    "三星S24": {"商品价格": 5999, "商品数量": 2},
    "OPPO Find X7": {"商品价格": 4299, "商品数量": 4},
    "vivo X100": {"商品价格": 3999, "商品数量": 5},
    "荣耀Magic 6": {"商品价格": 4699, "商品数量": 3},
    "一加12": {"商品价格": 4299, "商品数量": 4},
    "魅族21": {"商品价格": 3699, "商品数量": 2},
    "红米K70": {"商品价格": 2499, "商品数量": 10}
}

# 1. 输出购物车菜单
print(f'欢迎使用购物车系统')
menu = """
###### 购物车系统 ######
#   1. 添加购物车      #
#   2. 删除购物车      #
#   3. 修改购物车      #
#   4. 查询购物车      #
#   5. 推出购物车      #
######################
"""
print(menu)
choice = input("请选择要执行的操作")

# 2. 匹配选项
match choice:
    case 1:
        pass
    case 2:
        pass
    case 3:
        pass
    case 4:
        pass
    case 5:
        pass
    case _:
        print(f'非法操作')









