"""
可以容纳对分数据的数据类型，容器内美分数据都是一个元素，每个元素可以是不同的类型的数据，如字符串、数字、布尔等

根据：是否支持重复元素     是否可修改      是否有序     分类
"""




"""
总结

数据类型特性对比表

| 特性      | 字符串 (str) |    列表 (list)   | 元组 (tuple) | 集合 (set) | 字典 (dict) |

| 有序性    |      有序    |      有序        |    有序      |    无序     | 有序(3.7+)  |
| 重复元素  |      允许    |      允许        |     允许      |   不允许   |   key不允许  |
| 可变性    |     不可变   |      可变        |     不可变    |    可变    |   可变       |
| 索引访问  |      支持    |      支持        |     支持      |   不支持   |   不支持     |
| 切片操作  |      支持    |      支持        |     支持      |   不支持   |    支持      |
| 使用场景  |    文本处理   | 有序可重复数据集合 |   固定数据记录 | 去重数据集合 | 键值对存储   |
"""







